In [1]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error

In [2]:
import pandas as pd

data = {
    "Name":["Ayush","Prakash","Ram","Divanshu","Siya","Hanu","Kartikey","Utkarsh","Aftab","Pawan"],
    "Age":[22,19,21,23,25,18,24,25,28,22],
    "Gender":["Male","Male","Female","Male","Female","Female","Male","Female","Female","Male"],
    "Purchase":[1,1,0,0,1,1,1,1,0,1]
}

df = pd.DataFrame(data)

x = df[["Name","Age","Gender"]]
y = df["Purchase"]


from sklearn.model_selection import train_test_split
# X_train,X_test,y_train,y_test = train_test_split(x, y, test_size=0.2)
X_train,X_test,y_train,y_test = train_test_split(x, y, test_size=0.2,random_state=34)
X_train

       Name  Age  Gender
8     Aftab   28  Female
2       Ram   21  Female
7   Utkarsh   25  Female
3  Divanshu   23    Male
4      Siya   25  Female
5      Hanu   18  Female
6  Kartikey   24    Male
1   Prakash   19    Male

In [3]:
X_test

    Name  Age Gender
0  Ayush   22   Male
9  Pawan   22   Male

In [4]:
y_train

8    0
2    0
7    1
3    0
4    1
5    1
6    1
1    1
Name: Purchase, dtype: int64

In [5]:
y_test

0    1
9    1
Name: Purchase, dtype: int64

In [6]:
df = pd.read_csv('Salary_Data.csv')
df.dropna(inplace=True)
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [7]:
df.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [8]:
x = df[["Years of Experience"]]
y = df["Salary"]

X_train,X_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=42)

model = LinearRegression()
model.fit(X_train,y_train)
y_pred = model.predict(X_test)

y_pred

array([121851.9658296 ,  86487.65739606,  65269.07233593, ...,
       100633.38076947, 128924.82751631,  79414.79570935])

In [9]:
c = model.intercept_
c

58196.21064922618

In [10]:
model.coef_

array([7072.86168671])